{"backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"config": {"strides": [1, 1], "filters": 32, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "padding": "valid", "name": "conv2d_1", "data_format": "channels_last", "kernel_size": [3, 3], "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 28, 28, 1], "trainable": true, "bias_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "filters": 64, "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "name": "conv2d_2", "data_format": "channels_last", "kernel_size": [3, 3], "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "padding": "valid", "dtype": "float32", "name": "max_pooling2d_1", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "name": "dropout_1", "seed": null, "trainable": true, "dtype": "float32", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "dtype": "float32", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_1", "kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 128}, "class_name": "Dense"}, {"config": {"rate": 0.5, "name": "dropout_2", "seed": null, "trainable": true, "dtype": "float32", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "dense_2", "kernel_constraint": null, "activation": "softmax", "activity_regularizer": null, "trainable": true, "bias_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "units": 10}, "class_name": "Dense"}]}, "class_name": "Sequential", "keras_version": "2.3.1"}