{"config": {"name": "sequential_1", "layers": [{"config": {"name": "dense_1", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "units": 512, "trainable": true, "use_bias": true, "activation": "relu", "batch_input_shape": [null, 784]}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "seed": null, "noise_shape": null, "trainable": true, "dtype": "float32", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "units": 512, "trainable": true, "use_bias": true, "activation": "relu"}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "seed": null, "noise_shape": null, "trainable": true, "dtype": "float32", "rate": 0.2}, "class_name": "Dropout"}, {"config": {"name": "dense_3", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "units": 10, "trainable": true, "use_bias": true, "activation": "softmax"}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.3.1"}