{"config": {"name": "sequential_2", "layers": [{"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "units": 512, "name": "dense_4", "batch_input_shape": [null, 784], "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dtype": "float32", "trainable": true, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"rate": 0.2, "dtype": "float32", "seed": null, "noise_shape": null, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "bias_regularizer": null, "kernel_constraint": null, "units": 512, "name": "dense_5", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dtype": "float32", "trainable": true, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"rate": 0.2, "dtype": "float32", "seed": null, "noise_shape": null, "name": "dropout_4", "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "softmax", "bias_regularizer": null, "kernel_constraint": null, "units": 10, "name": "dense_6", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dtype": "float32", "trainable": true, "bias_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}]}, "backend": "tensorflow", "keras_version": "2.3.1", "class_name": "Sequential"}