{"backend": "tensorflow", "keras_version": "2.3.1", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "batch_input_shape": [null, 784], "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "units": 512, "kernel_regularizer": null, "dtype": "float32", "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "dtype": "float32", "rate": 0.2, "name": "dropout_1", "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"use_bias": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "units": 512, "kernel_regularizer": null, "dtype": "float32", "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "dtype": "float32", "rate": 0.2, "name": "dropout_2", "trainable": true, "seed": null}}, {"class_name": "Dense", "config": {"use_bias": true, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "units": 10, "kernel_regularizer": null, "dtype": "float32", "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null}}]}}