{"backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_3", "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "batch_input_shape": [null, 28, 28, 1], "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_regularizer": null, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "padding": "valid", "kernel_size": [3, 3]}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "strides": [1, 1], "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_constraint": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_regularizer": null, "filters": 64, "kernel_size": [3, 3], "use_bias": true, "dtype": "float32", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "dtype": "float32", "trainable": true, "padding": "valid", "name": "max_pooling2d_2"}}, {"class_name": "Dropout", "config": {"rate": 0.25, "seed": null, "dtype": "float32", "trainable": true, "noise_shape": null, "name": "dropout_3"}}, {"class_name": "Flatten", "config": {"dtype": "float32", "trainable": true, "data_format": "channels_last", "name": "flatten_2"}}, {"class_name": "Dense", "config": {"activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 128, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_3"}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "dtype": "float32", "trainable": true, "noise_shape": null, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 10, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "use_bias": true, "dtype": "float32", "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_4"}}], "name": "sequential_2"}, "keras_version": "2.3.1"}