{"backend": "tensorflow", "class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Dense", "config": {"bias_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 3072], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "dense_1", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "trainable": true, "units": 512, "kernel_regularizer": null, "dtype": "float32", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "rate": 0.2, "name": "dropout_1", "seed": null, "dtype": "float32"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "dense_2", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "trainable": true, "units": 512, "kernel_regularizer": null, "dtype": "float32", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "rate": 0.2, "name": "dropout_2", "seed": null, "dtype": "float32"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "name": "dense_3", "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "trainable": true, "units": 10, "kernel_regularizer": null, "dtype": "float32", "bias_regularizer": null}}]}, "keras_version": "2.3.1"}