{"config": {"layers": [{"config": {"kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 32, 32, 3], "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "dtype": "float32", "activity_regularizer": null, "use_bias": true, "activation": "linear", "bias_regularizer": null, "padding": "same", "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "filters": 32, "name": "conv2d_5"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_5", "dtype": "float32"}, "class_name": "Activation"}, {"config": {"kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "use_bias": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "padding": "valid", "dtype": "float32", "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "filters": 32, "name": "conv2d_6"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_6", "dtype": "float32"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_3", "padding": "valid", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "dtype": "float32"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "name": "dropout_3", "seed": null, "trainable": true, "dtype": "float32", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "use_bias": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "padding": "same", "dtype": "float32", "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "filters": 64, "name": "conv2d_7"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_7", "dtype": "float32"}, "class_name": "Activation"}, {"config": {"kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "strides": [1, 1], "use_bias": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "padding": "valid", "dtype": "float32", "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "filters": 64, "name": "conv2d_8"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_8", "dtype": "float32"}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "name": "max_pooling2d_4", "padding": "valid", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "dtype": "float32"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "name": "dropout_4", "seed": null, "trainable": true, "dtype": "float32", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last", "dtype": "float32"}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 512, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "name": "dense_1", "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_9", "dtype": "float32"}, "class_name": "Activation"}, {"config": {"rate": 0.5, "name": "dropout_5", "seed": null, "trainable": true, "dtype": "float32", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 10, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "name": "dense_2", "use_bias": true, "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "dtype": "float32"}, "class_name": "Dense"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_10", "dtype": "float32"}, "class_name": "Activation"}], "name": "sequential_2"}, "class_name": "Sequential", "keras_version": "2.3.1", "backend": "tensorflow"}