{"config": {"name": "sequential_1", "layers": [{"config": {"dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "batch_input_shape": [null, 32, 32, 3], "strides": [1, 1], "filters": 32, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "name": "conv2d_1", "trainable": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 32, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "name": "conv2d_2", "trainable": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_1", "dtype": "float32", "trainable": true, "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "dtype": "float32", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 64, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "name": "conv2d_3", "trainable": true, "padding": "same", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"name": "activation_3", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "strides": [1, 1], "filters": 64, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "name": "conv2d_4", "trainable": true, "padding": "valid", "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "activation": "linear"}, "class_name": "Conv2D"}, {"config": {"name": "activation_4", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_2", "dtype": "float32", "trainable": true, "padding": "valid", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_2", "dtype": "float32", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "dtype": "float32", "trainable": true, "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "units": 512, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_5", "dtype": "float32", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_3", "dtype": "float32", "trainable": true, "noise_shape": null, "seed": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"dtype": "float32", "kernel_constraint": null, "kernel_regularizer": null, "units": 10, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_2", "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "activation_6", "dtype": "float32", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}]}, "class_name": "Sequential", "keras_version": "2.3.1", "backend": "tensorflow"}