{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.3.1", "config": {"layers": [{"class_name": "Dense", "config": {"bias_constraint": null, "trainable": true, "bias_regularizer": null, "units": 512, "use_bias": true, "activity_regularizer": null, "activation": "relu", "batch_input_shape": [null, 3072], "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "dtype": "float32", "noise_shape": null, "seed": null, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "trainable": true, "bias_regularizer": null, "units": 512, "use_bias": true, "activity_regularizer": null, "activation": "relu", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "dtype": "float32", "noise_shape": null, "seed": null, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "trainable": true, "bias_regularizer": null, "units": 10, "use_bias": true, "activity_regularizer": null, "activation": "softmax", "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_3"}}], "name": "sequential_1"}}